// 동기와 비동기
// 동기
// : 여러개의 작업을 순서대로, 하나씩 처리하는 방식
// 자바스크립트는 코드를 동기적으로 실행한다.

// 단점도 있다.
// 쓰레드에 들어간 task들별로 처리 속도가 다를텐데 차례대로 하면 성능이 악화된다.


// 자바는 스레드를 동시에 사용하는 멀티스레드를 활용하지만
// 자바스크립트는 스레드가 하나뿐임  --> 멀티스레드 활용 X
// 그래서 비동기를 사용


// 비동기
// : 작업을 순서대로 처리하지 않는 방식

// + 각각의 작업들이 종료되었을 때 해당 작업의 결과값을 이용해서
// 또 다른 동작을 수행시켜야 한다면 각각의 작업에 콜백함수를 붙여서 처리할 수 있다.


console.log(1);

setTimeout(()=>{console.log(2)},3000);  // 비동기적으로 실행

console.log(3);


// 그런데 JS는 단일스레드라서 동시에 여러 작업을 못하는데
// 위 코드를 보면 3을 출력하면서 2를 출력하기 위해 3초 기다리는 작업을 동시에 하는 걸로 보인다.

// setTimeout() 같은 비동기 작업들은 자바스크립트 엔진에 있는 스레드가 실행하는 게 아니라
// Web APIs라는 브라우저가 직접 관리하는 별도의 공간에서 따로 실행이 되기 때문!

// 과정
// 브라우저에 탑재되어 있는 자바스크립트 엔진은 코드를 한줄씩 동기적으로 처리하다가
// setTimeout 같은 비동기 함수를 만나면 그걸 브라우저의 Web APIs로 실행해달라고 보낸다.
// setTimeout과 그 안에 들어간 콜백함수를 함께 보낸다.

// 자바스크립트 엔진에 있는 작업들이 모두 실행 완료되고

// Web APIs에 있는 타이머가 완료가 되면, 아까 전달받은 콜백함수를 자바스크립트 엔진에게 돌려준다.

// 이후 자바스크립트 엔진이 돌려받은 콜백함수를 실행시킨다.

